In [1]:
import csv
import numpy as np
import pandas as pd

# Task:
- Sub-sample the dataset so that you have equal entries for positive, neutral and negative.

In [2]:
RANDOM_STATE = 42

## Import CSV

In [3]:
df = pd.read_csv("dataset.csv", encoding='cp1252')

- As we can see, it has 68,440 rows and 10 columns

In [4]:
df.shape

(68440, 10)

## Data stats
- 48k positive
- 16k neutral
- 3.4k negative

In [5]:
df.groupby('label').count()

,bookID,title,author,rating,ratingsCount,reviewsCount,reviewerName,reviewerRatings,review
label,,,,,,,,,
-1,3434,3426,3431,3434,3434,3434,3403,3434,3434
0,16384,16354,16348,16384,16384,16384,16197,16384,16384
1,48622,48498,48464,48622,48622,48622,48185,48622,48622

## Subsample the data 
- Idea: each label needs to be represented equally
- Create seperate dataframes filled with pos, neg, and neutral values

In [6]:
df_pos = df[df['label']==1]
df_neutral = df[df['label']==0]
df_neg = df[df['label']==-1]

- Take 3,000 randomly selected values of each data frame

In [7]:
df_neg_sampled = df_neg.sample(3000, random_state=RANDOM_STATE)
df_pos_sampled = df_pos.sample(3000, random_state=RANDOM_STATE)
df_neutral_sampled = df_neutral.sample(3000, random_state=RANDOM_STATE)

In [8]:
df_neg_sampled.shape

(3000, 10)

- Combine them into one dataframe where each label is represented equally

In [9]:
frames = [df_neg_sampled, df_pos_sampled, df_neutral_sampled]
result = pd.concat(frames)
result.shape

(9000, 10)

In [10]:
result.groupby('label').count()

,bookID,title,author,rating,ratingsCount,reviewsCount,reviewerName,reviewerRatings,review
label,,,,,,,,,
-1,3000,2992,2998,3000,3000,3000,2974,3000,3000
0,3000,2998,2997,3000,3000,3000,2963,3000,3000
1,3000,2993,2991,3000,3000,3000,2981,3000,3000

 ## Write the balanced data to file

In [11]:
result.to_csv('balanced_dataset.csv', encoding='utf-8', index=False)